# IsEqual Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColorEntry..::..IsEqual Method
AnalysisDisplayColorEntry Class See Also
---
Compare color entries.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsEqual(
	AnalysisDisplayColorEntry other
)
```

Visual Basic
---
```text
Public Function IsEqual ( _
	other As AnalysisDisplayColorEntry _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqual(
	AnalysisDisplayColorEntry^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Analysis..::..AnalysisDisplayColorEntry Color entry to compare to.
# ### Return Value
True if color entries are equal, false otherwise.
# See Also
AnalysisDisplayColorEntry Class
Autodesk.Revit.DB.Analysis Namespace